<script setup lang="ts">
import { useRouter } from "vue-router";

const router = useRouter();
</script>

<template>
  <section>
    <h1>Соглашение о конфиденциальности</h1>

    <p>
      Данная политика конфиденциальности является частью Пользовательского
      соглашения. Все термины, используемые в Пользовательском соглашении,
      применимы к данной политике. Используя портал "Ресторанный ресурс", Вы тем
      самым даете согласие на сбор и использование ваших персональных данных в
      соответствии с данной Политикой конфиденциальности.<br /><br />
      Мы в полной мере осознаем важность ваших персональных данных. В данной
      Политике конфиденциальности описывается, какие персональные данные мы
      получаем и собираем, когда вы пользуетесь Сайтом "Ресторанный ресурс".<br /><br />
      Мы можем дополнительно просить вашего согласия на использование ваших
      персональных данных для целей, на которые данная Политика
      конфиденциальности не распространяется. Вы не обязаны соглашаться, но если
      вы решите не давать своего согласия, ваше участие в определенных
      активностях может быть ограничено. Если вы даете свое согласие на
      дополнительные условия, они будут превалировать в случае их расхождения с
      условиями настоящей Политики конфиденциальности.<br /><br />
      Мы предпринимаем все разумные меры предосторожности для сохранности ваших
      персональных данных и требуем того же от третьих лиц, которые могут
      обрабатывать ваши персональные данные для нас. Доступ к вашим персональным
      данным ограничен в целях предотвращения несанкционированного доступа,
      изменения или неправомерного использования, и разрешен только для наших
      сотрудников и подрядчиков.
    </p>

    <article>
      <h3>Цели обработки персональных данных</h3>

      <ul>
        Мы собираем и храним только те персональные данные, которые необходимы
        для вашего с нами комфортного взаимодействия, а именно в целях:

        <li>
          оказания услуг Пользователям и Авторам в рамках функционала Сайта;
        </li>
        <li>идентификации и взаимодействия;</li>
        <li>
          направления уведомлений или иных информационных материалов и запросов;
        </li>
        <li>проведения статистических исследований;</li>
        <li>обработки платежей;</li>
        <li>мониторинга операций;</li>
        <li>предотвращения мошенничества;</li>
        <li>индивидуализации вашей работы с Сайтом;</li>
      </ul>
    </article>

    <article>
      <h3>Перечень информации, которую мы собираем и обрабатываем</h3>

      <p>
        Обычно персональные данные включают в себя информацию, которая позволяет
        вас идентифицировать. Она включает в себя имя, адрес, псевдоним (ник),
        фотографию, адрес электронной почты и номер телефона, но также может
        включать другую информацию, такую как IP-адрес, читательские
        предпочтения, хобби и интересы.
      </p>

      <span> Источниками ваших персональных данных служат:</span>

      <ul>
        1. Данные, которые вы предоставляете нам самостоятельно. Это могут быть:
        <li>email адрес</li>
        <li>имя пользователя</li>
        <li>номер телефона</li>
        <li>возраст</li>
        <li>дату рождения</li>
        <li>пол</li>
        <li>
          любые другие персональные данные, которые вы добровольно
          предоставляете нам
        </li>
      </ul>

      <ul>
        2. Данные, поступающие автоматически при использовании Сайта. Это могут
        быть:

        <li>данные о типе используемого вами браузера</li>
        <li>статистика просмотренных вами страниц</li>
        <li>ваш IP-адрес</li>
        <li>куки (Cookie)</li>
      </ul>

      <p>
        Когда вы посещаете Сайт "Ресторанный ресурс", на ваш компьютер
        отправляются один или несколько файлов cookie. Это небольшой файл, в
        котором содержатся наборы символов и который позволяет идентифицировать
        браузер.<br /><br />
        Когда вы регистрируетесь на Сайте, на ваш компьютер могут отправляться
        дополнительные файлы cookie, позволяющие избежать повторного ввода имени
        пользователя и пароля при следующем визите. Вы можете стереть их по
        окончании сеанса, если используете общедоступный компьютер и не желаете
        открывать свои данные последующим пользователям компьютера.<br /><br />
        Мы используем файлы cookie, чтобы повысить качество наших услуг путем
        сохранения пользовательских настроек и отслеживания тенденций в
        действиях. Большинство браузеров изначально настроены так, чтобы
        принимать файлы cookie, однако вы можете полностью запретить
        использование файлов cookie или настроить показ уведомлений об их
        отправке. Обратите внимание на тот факт, что без файлов cookie некоторые
        функции сайта могут работать некорректно.
      </p>
    </article>

    <article>
      <h3>Ваши права в отношении персональных данных</h3>

      <ul>
        Вы вправе:

        <li>
          ограничить или отказаться от получения от нас рассылок или сообщений в
          будущем;
        </li>

        <li>
          исправить, обновить или удалить ваши персональные данные из нашего
          хранилища;
        </li>

        <li>
          сообщить о несанкционированном использовании ваших персональных
          данных.
        </li>
      </ul>
    </article>

    <article>
      <h3>Изменения в политике конфиденциальности</h3>

      <p>
        Обратите внимание, что политика конфиденциальности может периодически
        изменяться.
      </p>

      <p>
        ЕСЛИ ВЫ НЕ СОГЛАСНЫ НА СБОР, ИСПОЛЬЗОВАНИЕ И РАСКРЫТИЕ ВАШИХ
        ПЕРСОНАЛЬНЫХ ДАННЫХ ТАКИМ ОБРАЗОМ, ПОЖАЛУЙСТА, НЕ ПОЛЬЗУЙТЕСЬ УСЛУГАМИ
        САЙТА.
      </p>
    </article>

    <button @click.prevent="router.push({ path: '/restresource.ru/signup' })">
      Go back
    </button>
  </section>
</template>

<style lang="scss" scoped>
section {
  background: var(--scheme-v1);
  display: flex;
  flex-direction: column;
  gap: 40px;
  max-width: 1360px;
  margin: auto;
  padding: 40px;

  h1 {
    font-size: 30px;
  }

  article {
    display: grid;
    gap: 20px;

    &:last-of-type {
      p {
        &:last-child {
          font-weight: 400;
        }
      }
    }
  }

  ul {
    display: grid;
    gap: 20px;
    list-style: disc;

    li {
      margin-left: 40px;
    }
  }

  button {
    background: var(--scheme-v2);
    color: var(--scheme-v1);
    padding: 15px;
  }
}
</style>
